{
    "When I search my name, it doesn't show up. What's going on?": "There are a couple of requirements that need to be met in order for times to be recorded. Please go through the following:<br><br><ol><li>Make sure that you are authorized on the SRP Discord. You need to connect your Steam account to SRP's AssettoServer services. Navigate to #ac_server_info. If you are not authorized, there will be a message from 'AssettoServer Hub' with a link to authenticate your Steam account. Otherwise, it will instead state 'Manage Steam Account'.</li><li>Ensure that you have a valid run on one of the Official SRP Servers. A valid run is a full lap of the route without touching any of the walls. You will know you have a valid run when you complete a lab because a log message will appear with the route and your time. It will look like:<br> 'Lap time for [ROUTE]: [TIME]'<br>(Ex. 'Lap time for Bayshore Northbound: 4:32.98')<br><br><i>*Do note that if there is an (invalid) at the end, that means that you have touched a wall during your run and the time will not be counted.</i></li></ol><br>If all of these requirements are met, then your time will show up on the offical leaderboard. If the search is failing, please make sure that you are using the correct fields in the search form. If you see your time on the leaderboard but it does not show up in our search, please file a bug report <a href='https://github.com/jonathanlo411/srp-search/issues/new/choose' target='_blank' rel='norefferer'>here</a> so we can get that fixed.",
    "What does the it mean a result row is purple?": "Congratulations! This means that you have the fastest time for that leaderboard, route, and car. Do note that when you toggle 'Current Month', it means that you have the fastest time for that current month (for that leaderboard, route, and car). If you are authenticated on the offical SRP Discord, this will give you a 'Fast Driver' tag under your Discord profile.",
    "What do the different modes mean?": "<ul><li><h3>Timing</h3>This mode is for timed runs on both Traffic and non-Traffic servers. SRP servers will automaitcally time you when you run a route and put it on the leaderboard if you are authorized.</li><li><h3>Points</h3>This is a point score that is given based on your fastest times. If you are ranked 3rd for example, you will get +25 points to your overall score. By default, the leaderboard combines all points earned across car and leaderboard.</li><li><h3>Overtake</h3>This a newer mode compared to the others. This mode tracks how many cars you can overtake without crashing. The minimum speed is 80km/h. You can enable an overtake run in-game by going to the in-game chat, clicking the lightbulb, and clicking 'Overtake Run'. This will enable the mode for the rest of the session. Do note that this mode is only available on Traffic servers.</li></ul>",
    "Why does it take so long to search XYZ?": "The server checks every single page of the conditions set in the form. However, if you are searching for either Points or Overtake, it will be quick unless you are near the bottom of the leaderboard."
}